# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

#+latex: \newcommand{\mytitle}{Ponteiros e Vetores}
#+latex: \mytitleslide

* Exemplo #3 ~a28-diferencas.c~

#+BEGIN_SRC C :tangle e/a28-diferencas.c
#include <stdio.h>
#define TAM 3
int main() {

  int v[TAM] = {1,2,3};
  int *p;
  p = v; //operação válida. Atribui a p o endereço do primeiro elemento de v
  v = p; //operação inválida (pois v aponta para um endereço fixo de memória)

  return 0;
}
#+END_SRC

#+latex: \pause

Compilando para ver *error*

#+begin_src shell :results output :exports both
gcc a28-diferencas.c 2> x; cat x
#+end_src

#+RESULTS:
: a28-diferencas.c: In function ‘main’:
: a28-diferencas.c:9:5: error: assignment to expression with array type
:    v = p; //operação inválida (pois v aponta para um endereço fixo de memória)
:      ^

